#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```

aws_route53_zone.this["thesamcro.com"]: Refreshing state... [id=Z0435032UBOTXJWG12IM]
aws_vpc.this[0]: Refreshing state... [id=vpc-0d94ad3dc3cf9d85c]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
aws_route_table.public[0]: Refreshing state... [id=rtb-005957174f54f5c6d]
aws_route_table.private[0]: Refreshing state... [id=rtb-0073747fb42ccdab4]
aws_default_security_group.this[0]: Refreshing state... [id=sg-07db7ad127aca9b9c]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-09f7900d0480aed0a]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-036440546d8eb0c76]
aws_subnet.private[1]: Refreshing state... [id=subnet-0c922c6a98dcf1e3b]
aws_subnet.public[1]: Refreshing state... [id=subnet-06bd693a610ba1902]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-014282ca4ee0f3cc9]
aws_subnet.public[0]: Refreshing state... [id=subnet-07cc71c8ccae57316]
aws_subnet.public[2]: Refreshing state... [id=subnet-0818b77399efcd5c4]
aws_subnet.private[2]: Refreshing state... [id=subnet-08c7c8dc742580a6e]
aws_subnet.private[0]: Refreshing state... [id=subnet-0968647d51820050b]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-005957174f54f5c6d1080289494]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0787749d2487d9d0a]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0790709fe9bd34646]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f4adf4b730a8d5ea]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01739f9831d365050]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-064aae29ec5049a56]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b588fcc72e3cd5f3]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.wrapper["thesamcro.com"].aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "thesamcro.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.thesamcro.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "thesamcro.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.thesamcro.com",
          + "thesamcro.com",
        ]
      + tags                      = {
          + "Name" = "thesamcro.com"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Name"        = "thesamcro.com"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.wrapper["thesamcro.com"].aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.wrapper["thesamcro.com"].aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0435032UBOTXJWG12IM"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + wrapper = {
      + "thesamcro.com" = {
          + acm_certificate_arn                       = (known after apply)
          + acm_certificate_domain_validation_options = (known after apply)
          + acm_certificate_status                    = (known after apply)
          + acm_certificate_validation_emails         = (known after apply)
          + distinct_domain_names                     = [
              + "thesamcro.com",
            ]
          + validation_domains                        = (known after apply)
          + validation_route53_record_fqdns           = [
              + (known after apply),
            ]
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `workload`, Workflow: `Terragrunt CI/CD pipeline`*